app/controllers/checkouts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", ""], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "hhm"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", ""], ["created_at", "2017-09-14 02:46:20.266958"], ["updated_at", "2017-09-14 02:46:20.266958"]]
---
  def checkout
    amount = params["amount"] # In production you should not take amounts directly from clients
    nonce = params["payment_method_nonce"]
    email = params["email"]
    # puts email
    # user = User.find_by email: email
    # puts user
    # if user === nil
    if not User.where(email: email).exists?
      puts json:'user_no_exist'
      result = Braintree::Transaction.sale(
          amount: amount,
          payment_method_nonce: nonce,
          :options => {
            :submit_for_settlement => true
          }
        )
      if result.success? || result.transaction
        puts "success"
        User.find_or_create_by(email: email)